homework/Lab05-06/combustorSprayWallFilmReitzKHRT/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                     
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 10 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    fuel_inlet
    {
        type            fixedValue;
        value           uniform (0 15 0);
    }

    "(back|sides)"
    {
        type            noSlip;
    }

    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
