homework/Lab05-06/combustorSprayWallFilmReitzKHRT/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                     
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    outlet
    {
        type            zeroGradient;
    }

    fuel_inlet
    {
        type            fixedValue;
        value           uniform 350;
    }

    "(back|sides)"
    {
        type            zeroGradient;
    }

    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            fixedValue;
        value           uniform 300;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
